blog/index.org
#+TITLE: CtrlAltDelete.nu
#+DESCRIPTION: It's all about 42, (defn foobarbaz []) and cheeseburgers.
#+AUTHOR: Anton Erholt
#+STARTUP: indent hidestars
#+STARTUP: logdone
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+LANGUAGE:  en
#+HUGO_SECTION: blog
#+HUGO_BASE_DIR: ../
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_WEIGHT: auto

** DONE The Sims - a short presentation                :game:design:
:PROPERTIES:
:EXPORT_FILE_NAME: the-sims-presentation
:EXPORT_DATE: 2013-11-20
:END:

We made a short presentation on the Sims in class. Here are the slides and the
script.

*** HISTORY - Slide
- The Sims is the first game in the series. Developed by Maxis and
  published by Electronic Arts, it was released for Microsoft Windows
  in February 2000.
- The Sims 2 are released on September 14, 2004. The sequel, developed
  by Maxis, takes place in a full 3D environment with every sim having
  an aspiration system.
- The Sims 3 are released on June 2, 2009. Game has open, seamless
  neighbourhood, with improved tools for sim creation, enhanced build
  and buy mode functions, and the introduction of wishes and goals.
- The Sims 4 will be available in 2014. It allows creating sims with
  intelligence and emotion. It provides new intuitive creative tools
  to sculpt sims and build unique homes. Game gives control over the
  mind, body, and heart of sims to bring stories to life.
- The Sims Online, The Sims Stories, MySims, The Sims Carnival, The
  Sims Medieval, The Sims Social …

*** HISTORY - Script/notes

- Sims 1 - Seven expansion packs and two bonafide deluxe editions with
  exclusive content have been released for this game. By March 22,
  2002, The Sims had sold more than 2 million copies worldwide, making
  it the best-selling P.C. game in history

- The Sims 2 is set some 25 years after the original game. For
  instance, the Goth family has aged significantly with Bella Goth
  mysteriously vanishing in the 25-year period. Because the entire
  game has progressed from 2D sprites to 3D models, all content in The
  Sims 2 had to be created from the ground up. Electronic Arts has
  released eight expansion packs and nine stuff packs for The
  Sims 2. Over 400 exclusive items have also been released for this
  game via The Sims 2 Store

- The Sims 3 sold 1.4 million copies in the first week, making it the
  largest release in PC gaming history at the time. The game has sold
  over 10 million copies worldwide since its release. Eleven expansion
  packs and nine stuff packs have been released for the third
  generation of the series. Notably, Maxis was no longer involved in
  the production

- The Sims 4 is built upon an entirely new technology. The content
  from The Sims 3 will not be transferable to The Sims 4. The Sims 4
  will be available for PC.

*** EFFECTS OF THE GAME - Slide


- The Sims is one of first full-commercial strategic life-simulation
  video games that still is most successful artificial life game
- Inspired other games
- Has real life applications

*** EFFECTS OF THE GAME - Script/notes
Artificial life games and life simulations find their origins in
artificial life research, including Conway's Game of Life from 1970.
But one of the first commercially viable artificial life games was
Little Computer People in 1985, a Commodore 64 game that allowed
players to type requests to characters living in a virtual house. The
game is cited as a little-known forerunner of virtual-life simulator
games to follow. One of the earliest dating sims, Tenshitachi no gogo,
was released for the 16-bit NEC PC-9801 computer that same year,
though dating sim elements can be found in Sega's earlier Girl's
Garden in 1984. In 1986, the early biological simulation game Bird
Week was released. In the mid-1990s, as artificial intelligence
programming improved, true AI virtual pets such as Petz and Tamagotchi
began to appear. Around the same time, Creatures became "the first
full-blown commercial entertainment application of Artificial Life and
genetic algorithms".

*** BEHAVIOUR OF THE PLAYER - Slide
- Cheats - Infinite money - Maximum skills
- Different objectives
   - Dream house
   - Killing
   - Woo Hoo
- Aspects of life (University, Seasons, Pets…)

*** BEHAVIOUR OF THE PLAYER - Script/notes
What’s the most memorable thing about the Sims? We think it depends
greatly on how the player has behaved when playing. What do we
remember the most?  The cheats and the ability to play God. There are
a lot of different cheats, and most of you remember ‘motherlode’ or
‘rosebud’ to get more money;!;!;!; We all have different objectives
when playing the Sims such as acting out your dream of becoming an
architect and designing your dream house, or perhaps playing God and
killing your Sims off in different ways. There are several ways of
doing this, like trapping your Sims in a room with fire, removing the
ladder when they’re in the pool so they drown or simply by letting
them age. Another way of behaving in game, could of course be to do
“the right thing” and let their Sims create a family and live their
life as intended. Also are several different aspects of life which the
player can focus on, for instance “University, Seasons, Pets… etc.”

